Repository: Devtory-GbR/flutter-template
Catalog: lib/l10n/app_*.arb
Languages: de

source: Hello World!
de: Hallo Welt!

# hello
source: Hello {userName}
de: Hallo {userName}

# errorTitle
source: Oops! Unexpected error 😭
de: Oops! Unerwarteter Fehler 😭

# error
source: Looks like something went completely wrong! But don't worry - it can happens to the best of us - and just happend to you. Maybe try again or go on 'help'.
de: Es ist irgendetwas völlig schief gelaufen! Aber keine Sorge - es kann den Besten passieren - und ist gerade dir passiert. Versuche es noch einmal oder gehe auf 'Hilfe'.

# errorHttpTitle
source: Oops! HTTP Error 😢
de: Oops! HTTP Fehler 😢

# errorHttp
source: Looks like you try to make a request with insufficient permissions or parameters. Maybe try again or go on 'help'.
de: Es sieht so, als hättest du eine Anfrage mit unzureichenden Berechtigungen oder Parametern getätigt. Versuche es noch einmal oder gehe auf 'Hilfe'.

# errorServerTitle
source: Oops! Server Error 😱
de: Oops! Server Fehler 😱

# errorServer
source: Looks like you request cause on error on the server - hope you don't crashed it... Maybe try again or go on 'help'.
de: Es sieht so aus, als hätte deine Anfrage Probleme auf dem Server verursacht - hoffe der Server läuft noch... Versuche es noch einmal oder gehe auf 'Hilfe'.

# errorNetworkTitle
source: Oops! Network Error 🥺
de: Oops! Netzwerk Fehler 🥺

# errorNetwork
source: Looks like you request could not send. Maybe problem with the network? Try again or go on 'help'.
de: Es sieht so aus, als ob deine Anfrage nicht gesendet werden konnte. Hast du Probleme mit dem Internet? Versuche es noch einmal oder gehe auf 'Hilfe'.

# errorInvalidTokenAutoLogout
source: Session is no longer available. You have been logged out automatically.
de: Sitzung ist nicht länger verfügbar. Du wurdest automatisch ausgeloggt.

source: no content
de: kein Inhalt

source: simulate hard error
de: Simuliere harten Fehler

# simulateClientError
source: simulate http client error
de: Simuliere HTTP Client Fehler

# simulateHttpError
source: simulate http status error
de: Simuliere HTTP Status Fehler

# simulateTokenInvalidError
source: simulate invalid token error
de: Simuliere Invalid Token Fehler

source: Settings
de: Einstellungen

source: Language
de: Sprache

# languageChoice
source: {choice, select, en {English} de {German} systemLanuage {System} other{}}
de: {choice, select, en {Englisch} de {Deutsch} systemLanuage {Systemsprache} other {}}

source: Theme
de: Darstellung

# themeChoice
source: {choice, select, light {Light} dark {Dark} other{}}
de: {choice, select, light {Hell} dark {Dunkel} other{}}

source: About
de: Über

source: License
de: Lizenz

source: Logout
de: Abmelden

source: Log
de: Protokoll

source: Help
de: Hilfe

source: Device info
de: Geräteinfo

source: Login
de: Anmelden

source: code required
de: Code erforderlich

# codeIncorrect
source: Sry 😥. Code incorrect
de: Upps 😥. Falscher Code
